{"head":{"description":"Semantic versioning policy We follow semantic versioning. However, due to the nature of stylelint as a code quality tool, we've defined the…","title":"Semantic versioning policy"},"body":"<h1 id=\"semantic-versioning-policy\"><a href=\"#semantic-versioning-policy\" class=\"phenomic-HeadingAnchor\">#</a>Semantic versioning policy</h1>\n<p>We follow <a href=\"http://semver.org\">semantic versioning</a>. However, due to the nature of stylelint as a code quality tool, we've defined the following policy for stylelint:</p>\n<ul>\n<li>\n<p>patch release (intended to not break your lint build)</p>\n<ul>\n<li>a bug fix in a rule that results in stylelint reporting fewer errors</li>\n<li>a bug fix to the CLI or core (including formatters)</li>\n<li>improvements to documentation.</li>\n<li>non-user-facing changes such as refactoring code or modifying tests</li>\n<li>re-releasing after a failed release (i.e., publishing a release that doesn't work for anyone)</li>\n</ul>\n</li>\n<li>\n<p>minor release (might break your lint build)</p>\n<ul>\n<li>a bug fix in a rule that results in stylelint reporting more errors</li>\n<li>a new rule is created</li>\n<li>a new option to an existing rule that does not result in stylelint reporting more errors by default</li>\n<li>an existing rule is deprecated</li>\n<li>a new CLI capability is created</li>\n<li>a new public API capability is created</li>\n<li>a new formatter is created</li>\n</ul>\n</li>\n<li>\n<p>major release (likely to break your lint build)</p>\n<ul>\n<li>a change in the documented behaviour of an existing rule results in stylelint reporting more errors by default</li>\n<li>an existing rule is removed</li>\n<li>an existing formatter is removed</li>\n<li>part of the a CLI is removed or changed in an incompatible way</li>\n<li>part of the public API is removed or changed in an incompatible way</li>\n</ul>\n</li>\n</ul>\n","__filename":"user-guide/semantic-versioning-policy.md","__url":"/user-guide/semantic-versioning-policy/","__resourceUrl":"/user-guide/semantic-versioning-policy/index.html","__dataUrl":"/user-guide/semantic-versioning-policy/index.html.69b232ef30889894cb4c4c6742736a5b.json"}