{"head":{"description":"Release planning Sometimes an upcoming release needs a little extra planning (and help from the stylelint community) to make the transition…","title":"Release planning"},"body":"<h1 id=\"release-planning\"><a href=\"#release-planning\" class=\"phenomic-HeadingAnchor\">#</a>Release planning</h1>\n<p>Sometimes an upcoming release needs a little extra planning (and help from the stylelint community) to make the transition as smooth as possible.</p>\n<h2 id=\"800\"><a href=\"#800\" class=\"phenomic-HeadingAnchor\">#</a><code>8.0.0</code></h2>\n<p>In <code>8.0.0</code> we will be removing:</p>\n<ul>\n<li>the <code>declaration-block-properties-order</code> rule.</li>\n</ul>\n<p>The <code>declaration-block-properties-order</code> rule will be replaced by <a href=\"https://github.com/hudochenkov/stylelint-order\"><code>stylelint-order</code></a>, a community plugin pack of ordering rules. One that contains rules for ordering properties, property groups and <em>other things</em> within declaration blocks. Please consider contributing to <code>stylelint-order</code> to ensure it is robust and handles your particular use-case. This will provide a smoother transition to <code>8.0.0</code>, once it is ready.</p>\n<h2 id=\"700\"><a href=\"#700\" class=\"phenomic-HeadingAnchor\">#</a><code>7.0.0</code></h2>\n<p>In <code>7.0.0</code> we will be removing:</p>\n<ul>\n<li>the <code>emptyLineBefore</code> option from the <code>declaration-block-properties-order</code> rule.</li>\n<li>the <code>hierarchicalSelectors</code> option from the <code>indentation</code> rule.</li>\n<li>the <code>-e</code> and <code>--extract</code> CLI flags and the <code>extractStyleTagsFromHtml</code> node API option.</li>\n</ul>\n<p>This is to ensure that development on the linter remains sustainable.</p>\n<p>The <code>declaration-block-properties-order</code> rule will, as the name implies, check only the order of properties within a declaration block. It will not be concerned with whitespace between declarations. As such, the <code>emptyLineBefore</code> option within the \"group objects\" configuration feature, i.e:</p>\n<pre><code class=\"hljs language-json\">[\n  {\n    <span class=\"hljs-attr\">\"emptyLineBefore\"</span>: <span class=\"hljs-string\">\"always\"</span>,\n    <span class=\"hljs-attr\">\"properties\"</span>: [\n      <span class=\"hljs-string\">\"height\"</span>,\n      <span class=\"hljs-string\">\"width\"</span>,\n    ],\n  }, {\n    <span class=\"hljs-attr\">\"emptyLineBefore\"</span>: <span class=\"hljs-string\">\"always\"</span>,\n    <span class=\"hljs-attr\">\"properties\"</span>: [\n      <span class=\"hljs-string\">\"color\"</span>,\n      <span class=\"hljs-string\">\"font\"</span>,\n    ],\n  }\n]</code></pre>\n<p>will be removed in <code>7.0.0</code>. This is an opportunity for the community to develop a more powerful and open-ended plugin for specifying the <em>structure of a block</em>. There's also an opportunity to align such a plugin with an existing block sorting PostCSS plugin, e.g. <a href=\"https://github.com/hudochenkov/postcss-sorting\"><code>postcss-sorting</code></a>, which supports, amongst other things, specifying the order of nested rules and at-rules within a block.</p>\n<p>The <code>indentation</code> rule will only check the more common use-case of block-level indentation. As such, the <code>hierarchicalSelectors</code> option will be removed. If you use the <code>hierarchicalSelectors</code> option please consider creating a plugin for this specific code style and sharing it with the community.</p>\n<p>The <code>-e</code> and <code>--extract</code> flags and the <code>extractStyleTagsFromHtml</code> node API option will be replaced by an extensible processor system. If you currently use these flags or this option to extract CSS code from HTML files, please consider <a href=\"../../developer-guide/processors/\">building a processor</a> for the community.</p>\n<p>All being well, the community will, if there is a need, create these plugins and processors while the stylelint team focuses on developing <code>7.0.0</code>. This will provide a smoother transition to <code>7.0.0</code>, once it is ready.</p>\n","__filename":"user-guide/release-planning.md","__url":"/user-guide/release-planning/","__resourceUrl":"/user-guide/release-planning/index.html","__dataUrl":"/user-guide/release-planning/index.html.2f54b767e3dee65b005f50a17b57989d.json"}