{"head":{"description":"Contributing Respect that people have differences of opinion and that every design or implementation choice carries a trade-off and…","title":"Contributing"},"body":"<h1 id=\"contributing\"><a href=\"#contributing\" class=\"phenomic-HeadingAnchor\">#</a>Contributing</h1>\n<p>Respect that people have differences of opinion and that every design or implementation choice carries a trade-off and numerous costs. There is seldom a right answer, merely an optimal answer given a set of values and circumstances.</p>\n<p>Please keep unstructured critique to a minimum. If you have solid ideas you want to experiment with, make a fork and see how it works.</p>\n<p>As contributors and maintainers of this project, and in the interest of fostering an open and welcoming community, we pledge to respect all people who contribute through reporting issues, posting feature requests, updating documentation, submitting pull requests or patches, and other activities.</p>\n<p>We are committed to making participation in this project a harassment-free experience for everyone, regardless of level of experience, gender, gender identity and expression, sexual orientation, disability, personal appearance, body size, race, ethnicity, age, religion, or nationality.</p>\n<p>Examples of unacceptable behavior by participants include:</p>\n<ul>\n<li>The use of sexualized language or imagery</li>\n<li>Personal attacks</li>\n<li>Publishing other's private information, such as physical or electronic addresses, without explicit permission</li>\n<li>Public or private harassment</li>\n</ul>\n<p>This code of conduct applies both within project spaces and in public spaces when an individual is representing the project or its community.</p>\n<p>Instances of abusive, harassing, or otherwise unacceptable behavior may be reported by opening an issue or contacting one or more of the project maintainers.</p>\n<h2 id=\"financial-contributions\"><a href=\"#financial-contributions\" class=\"phenomic-HeadingAnchor\">#</a>Financial contributions</h2>\n<p>We also welcome financial contributions in full transparency on our <a href=\"https://opencollective.com/stylelint\">open collective</a>.\nAnyone can file an expense. If the expense makes sense for the development of the community, it will be \"merged\" in the ledger of our open collective by the core contributors and the person who filed the expense will be reimbursed.</p>\n<h2 id=\"credits\"><a href=\"#credits\" class=\"phenomic-HeadingAnchor\">#</a>Credits</h2>\n<h3 id=\"contributors\"><a href=\"#contributors\" class=\"phenomic-HeadingAnchor\">#</a>Contributors</h3>\n<p>Thank you to all the people who have already contributed to stylelint!\n<a href=\"graphs/contributors\"><img src=\"https://opencollective.com/stylelint/contributors.svg?width=890\" /></a></p>\n<h3 id=\"backers\"><a href=\"#backers\" class=\"phenomic-HeadingAnchor\">#</a>Backers</h3>\n<p>Thank you to all our backers! [<a href=\"https://opencollective.com/stylelint#backer\">Become a backer</a>]</p>\n<p><a href=\"https://opencollective.com/stylelint#backers\" target=\"_blank\"><img src=\"https://opencollective.com/stylelint/backers.svg?width=890\"></a></p>\n<h3 id=\"sponsors\"><a href=\"#sponsors\" class=\"phenomic-HeadingAnchor\">#</a>Sponsors</h3>\n<p>Thank you to all our sponsors! (please ask your company to also support this open source project by <a href=\"https://opencollective.com/stylelint#sponsor\">becoming a sponsor</a>)</p>\n<p><a href=\"https://opencollective.com/stylelint/sponsor/0/website\" target=\"_blank\"><img src=\"https://opencollective.com/stylelint/sponsor/0/avatar.svg\"></a></p>\n","__filename":"CONTRIBUTING.md","__url":"/CONTRIBUTING/","__resourceUrl":"/CONTRIBUTING/index.html","__dataUrl":"/CONTRIBUTING/index.html.488a9ee26ee12c2f18393f4067dbc6f8.json"}